//package main.java.com.ojiraphers.Quiz;
//
//import java.util.Scanner;
////
////public class Quiz3 {
////    /*
////    많은 수의 구슬을 10, 20개, 30개, 40개, 50개 단위로 묶으려 한다.
////    개수를 입력하면 각각의 단위로 몇 개의 묶음이 나오는지 계산하고,
////    나머지의 개수가 적은 순서대로 묶음 단위를 추천해주는 프로그램을 제작하고자 한다.
////
////
////    1. 개수를 입력한다
////    2. 10개 단위로 묶었을때 결과, 50까지 반복
////    3. 만약 나머지가 있다면 해당 묶음기준을 항목에서 제외하고
////    4. 남은 단위 중에서 최적의 묶음 단위를 도출해내 출력한다. (=나머지 정렬해서 적은 순서대로 출력)
////    5. 반드시 반복문을 사용해야 한다.
////     */
////
////    public static void main(String[] args) {
////
////        Scanner.sc = new Scanner(System.in);
////
////        in
////
////
////
////
////    }
////
//
//
//}
